In [4]:
import math
import pandas as pd

In [5]:
df = pd.read_csv("New1.csv")
df

     Name   Address  Country Good bad
0  Subodh  Barangdi    Nepal    1   0
1   Suraj  Kawaseti    Nepal    1   0
2    John  Mechigan      USA    0   1
3     NaN   Chelsea  England  yes  no
4     NaN        -1    Spain    1  no

In [6]:
df=pd.read_csv("New1.csv",header=None,names=["Name","Address","Country","Good","bad"])
df

     Name   Address  Country  Good  bad
0    Name   Address  Country  Good  bad
1  Subodh  Barangdi    Nepal     1    0
2   Suraj  Kawaseti    Nepal     1    0
3    John  Mechigan      USA     0    1
4     NaN   Chelsea  England   yes   no
5     NaN        -1    Spain     1   no

In [7]:
df = pd.read_csv("New1.csv",skiprows=1)
df

  Subodh  Barangdi    Nepal    1   0
0  Suraj  Kawaseti    Nepal    1   0
1   John  Mechigan      USA    0   1
2    NaN   Chelsea  England  yes  no
3    NaN        -1    Spain    1  no

In [27]:
df = pd.read_csv("New1.csv",na_values=[-1,0])
df = pd.read_csv("New1.csv",
                 na_values={
                    "Good":[0],
                    "bad":[0,"no"],
                     "Address":[-1]
                        },
                )                              #for na_values we can pass dictonary or a list
df

     Name   Address  Country Good  bad
0  Subodh  Barangdi    Nepal    1  NaN
1   Suraj  Kawaseti    Nepal    1  NaN
2    John  Mechigan      USA  NaN  1.0
3     NaN   Chelsea  England  yes  NaN
4     NaN       NaN    Spain    1  NaN

In [42]:
df=pd.read_csv("New1.csv",na_values = {
    "Name":"Not Inserted",
    "Address":-1,
    "Good":0,
    "bad":[0,"no"],
})
df

     Name   Address  Country Good  bad
0  Subodh  Barangdi    Nepal    1  NaN
1   Suraj  Kawaseti    Nepal    1  NaN
2    John  Mechigan      USA  NaN  1.0
3     NaN   Chelsea  England  yes  NaN
4     NaN       NaN    Spain    1  NaN

In [48]:
df.to_csv("created1.csv")              #it creates new index coluumn so to avoid it df.to_csv("created1.csv",index=False)
cf = pd.read_csv("created1.csv")
cf

   Unnamed: 0    Name   Address  Country Good  bad
0           0  Subodh  Barangdi    Nepal    1  NaN
1           1   Suraj  Kawaseti    Nepal    1  NaN
2           2    John  Mechigan      USA  NaN  1.0
3           3     NaN   Chelsea  England  yes  NaN
4           4     NaN       NaN    Spain    1  NaN

In [59]:
cf.to_csv("created2.csv",columns=["Name","Country","Good"]) #writing a csv file .... we can write without header by using "header=None"
created2=pd.read_csv("created2.csv")
created2

   Unnamed: 0    Name  Country Good
0           0  Subodh    Nepal    1
1           1   Suraj    Nepal    1
2           2    John      USA  NaN
3           3     NaN  England  yes
4           4     NaN    Spain    1

In [66]:
df = pd.read_excel("exel_data.xlsx","Sheet1") #reading excel file
df

     Name Address            Hobby   Age
0  Subodh   Palpa    Playing games    20
1  Binita    n.a.    Reading books    19
2   Usha    Palpa    Reading books    30
3   Deepa  Butwal  Clicking photos  n.a.
4   Bidur   Palpa    Playing games    17

In [94]:
# we can use converter to change the value in csv
def Age_converter(cell):
    if cell=="n.a.":
        return 19
    return cell
def Address_converter(cell):
    if cell=="n.a.":
        return None
    return cell
df = pd.read_excel("exel_data.xlsx","Sheet1",converters={
                   "Age":Age_converter,
                   "Address":Address_converter,
                   })
df

     Name Address            Hobby  Age
0  Subodh   Palpa    Playing games   20
1  Binita    None    Reading books   19
2   Usha    Palpa    Reading books   30
3   Deepa  Butwal  Clicking photos   19
4   Bidur   Palpa    Playing games   17

In [110]:
#writing to excel file
df.to_excel("Created_excel.xlsx",sheet_name="New Sheet",index=False)
exel_file1 = pd.read_excel("Created_excel.xlsx","New Sheet")
exel_file1

     Name Address            Hobby  Age
0  Subodh   Palpa    Playing games   20
1  Binita     NaN    Reading books   19
2    Usha   Palpa    Reading books   30
3   Deepa  Butwal  Clicking photos   19
4   Bidur   Palpa    Playing games   17

In [111]:
# using startrow and startcolumn
df.to_excel("Created_excel2.xlsx",sheet_name="New Sheet",index=False,startrow=4,startcol=4)
exel_file2 = pd.read_excel("Created_excel2.xlsx","New Sheet")
exel_file2

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,Name,Address,Hobby,Age
4,NaN,NaN,NaN,NaN,Subodh,Palpa,Playing games,20
5,NaN,NaN,NaN,NaN,Binita,NaN,Reading books,19
6,NaN,NaN,NaN,NaN,Usha,Palpa,Reading books,30
7,NaN,NaN,NaN,NaN,Deepa,Butwal,Clicking photos,19
8,NaN,NaN,NaN,NaN,Bidur,Palpa,Playing games,17

In [ ]:
#writing in different sheets
#this will create or update same file with different sheets

with pd.ExcelWriter("combined.xlsx") as writer:
    excel_file1.to_excel(writer,sheet_name="Sheet first")
    excel_file2.to_excel(writer,sheet_name="Sheet second")